Revit 2027 API
DirectShapeOptions.ReferencingOption Property
 Whether or not the geometry stored in a DirectShape object may be referenced.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeReferencingOption ReferencingOption { get; set; }
Public Property ReferencingOption As DirectShapeReferencingOption
	Get
	Set
public:
property DirectShapeReferencingOption ReferencingOption {
	DirectShapeReferencingOption get ();
	void set (DirectShapeReferencingOption value);
}
member ReferencingOption : DirectShapeReferencingOption with get, set
Property Value
DirectShapeReferencingOption
 The default value is Referenceable.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 If the geometry is not referenceable, it may not be used for dimensioning, snapping, alignment, or face-hosting. The element may still be selected by the user for operations which do not reference individual geometry objects.
See Also
Reference
DirectShapeOptions Class
Autodesk.Revit.DB Namespace